apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
/****************************************************************************
 * arch/arm/src/nrf91/nrf91_modem_sock.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <nuttx/debug.h>
#include <errno.h>
#include <syslog.h>
#include <string.h>
#include <stdio.h>

#include <sys/socket.h>
#include <sys/types.h>
#include <netinet/in.h>

#include <nuttx/wqueue.h>
#include <nuttx/arch.h>
#include <nuttx/net/usrsock.h>
#include <nuttx/net/ioctl.h>
#include <nuttx/signal.h>

#include <nuttx/wireless/lte/lte_ioctl.h>
#include <nuttx/wireless/lte/lte.h>

#undef s6_addr
#include "nrf_socket.h"
#include "nrf_modem_at.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_NET_USRSOCK_CUSTOM
#  error CONFIG_NET_USRSOCK_CUSTOM must be set
#endif

#ifndef CONFIG_SCHED_LPWORK
#  error CONFIG_SCHED_LPWORK must be set
#endif

#define NRF91_USRSOCK_BUFSIZE (4096)

#define MAX_CTRL_SOCKET_COUNT (1)
#define MAX_SOCKET_COUNT      (NRF_MODEM_MAX_SOCKET_COUNT + \
                               MAX_CTRL_SOCKET_COUNT)
#define CTRL_SOCKET_FIRST     (NRF_MODEM_MAX_SOCKET_COUNT)

/****************************************************************************
 * Private Data Types
 ****************************************************************************/

struct nrf91_sock_s
{
  bool in_use;
  bool recvpending;
};

struct nrf91_usrsock_s
{
  uint8_t             in[NRF91_USRSOCK_BUFSIZE];
  uint8_t             out[NRF91_USRSOCK_BUFSIZE];
  struct work_s       pollwork;
  struct nrf_pollfd   pollfd;
  struct nrf91_sock_s sock[MAX_SOCKET_COUNT];
};

typedef int (*usrsock_handler_t)(struct nrf91_usrsock_s *usrsock,
                                 const void *data, size_t len);

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int nrf91_usrsock_socket_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len);
static int nrf91_usrsock_close_handler(struct nrf91_usrsock_s *usrsock,
                                       const void *data, size_t len);
static int nrf91_usrsock_connect_handler(struct nrf91_usrsock_s *usrsock,
                                         const void *data, size_t len);
static int nrf91_usrsock_sendto_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len);
static int nrf91_usrsock_recvfrom_handler(struct nrf91_usrsock_s *usrsock,
                                          const void *data, size_t len);
static int nrf91_usrsock_setsockopt_handler(struct nrf91_usrsock_s *usrsock,
                                            const void *data, size_t len);
static int nrf91_usrsock_getsockopt_handler(struct nrf91_usrsock_s *usrsock,
                                            const void *data, size_t len);
static int nrf91_usrsock_getsockname_handler(struct nrf91_usrsock_s *usrsock,
                                             const void *data, size_t len);
static int nrf91_usrsock_getpeername_handler(struct nrf91_usrsock_s *usrsock,
                                             const void *data, size_t len);
static int nrf91_usrsock_bind_handler(struct nrf91_usrsock_s *usrsock,
                                      const void *data, size_t len);
static int nrf91_usrsock_listen_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len);
static int nrf91_usrsock_accept_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len);
static int nrf91_usrsock_ioctl_handler(struct nrf91_usrsock_s *usrsock,
                                       const void *data, size_t len);
static int nrf91_usrsock_shutdown_handler(struct nrf91_usrsock_s *usrsock,
                                          const void *data, size_t len);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct nrf91_usrsock_s g_usrsock;

static const usrsock_handler_t g_usrsock_handler[] =
{
  [USRSOCK_REQUEST_SOCKET]      = nrf91_usrsock_socket_handler,
  [USRSOCK_REQUEST_CLOSE]       = nrf91_usrsock_close_handler,
  [USRSOCK_REQUEST_CONNECT]     = nrf91_usrsock_connect_handler,
  [USRSOCK_REQUEST_SENDTO]      = nrf91_usrsock_sendto_handler,
  [USRSOCK_REQUEST_RECVFROM]    = nrf91_usrsock_recvfrom_handler,
  [USRSOCK_REQUEST_SETSOCKOPT]  = nrf91_usrsock_setsockopt_handler,
  [USRSOCK_REQUEST_GETSOCKOPT]  = nrf91_usrsock_getsockopt_handler,
  [USRSOCK_REQUEST_GETSOCKNAME] = nrf91_usrsock_getsockname_handler,
  [USRSOCK_REQUEST_GETPEERNAME] = nrf91_usrsock_getpeername_handler,
  [USRSOCK_REQUEST_BIND]        = nrf91_usrsock_bind_handler,
  [USRSOCK_REQUEST_LISTEN]      = nrf91_usrsock_listen_handler,
  [USRSOCK_REQUEST_ACCEPT]      = nrf91_usrsock_accept_handler,
  [USRSOCK_REQUEST_IOCTL]       = nrf91_usrsock_ioctl_handler,
  [USRSOCK_REQUEST_SHUTDOWN]    = nrf91_usrsock_shutdown_handler,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf2nx_family
 ****************************************************************************/

static int nrf2nx_family(int nrf_family)
{
  int nx_family = 0;

  if (nrf_family == NRF_AF_UNSPEC)
    {
      nx_family = AF_UNSPEC;
    }
  else if (nrf_family == NRF_AF_INET)
    {
      nx_family = AF_INET;
    }
  else if (nrf_family == NRF_AF_INET6)
    {
      nx_family = AF_INET6;
    }
  else if (nrf_family == NRF_AF_PACKET)
    {
      nx_family = AF_PACKET;
    }

  return nx_family;
}

/****************************************************************************
 * Name: nx2nrf_family
 ****************************************************************************/

static int nx2nrf_family(int nx_family)
{
  int nrf_family = 0;

  if (nx_family == AF_UNSPEC)
    {
      nrf_family = NRF_AF_UNSPEC;
    }
  else if (nx_family == AF_INET)
    {
      nrf_family = NRF_AF_INET;
    }
  else if (nx_family == AF_INET6)
    {
      nrf_family = NRF_AF_INET6;
    }
  else if (nx_family == AF_PACKET)
    {
      nrf_family = NRF_AF_PACKET;
    }
  else
    {
      nerr("unsupported nrf family %d\n", nx_family);
    }

  return nrf_family;
}

/****************************************************************************
 * Name: nx2nrf_type
 ****************************************************************************/

static int nx2nrf_type(int nx_type)
{
  int nrf_type = 0;

  if (nx_type == SOCK_STREAM)
    {
      nrf_type = NRF_SOCK_STREAM;
    }
  else if (nx_type == SOCK_DGRAM)
    {
      nrf_type = NRF_SOCK_DGRAM;
    }
  else if (nx_type == SOCK_RAW)
    {
      nrf_type = NRF_SOCK_RAW;
    }
  else
    {
      nerr("unsupported nrf type %d\n", nx_type);
    }

  return nrf_type;
}

/****************************************************************************
 * Name: nx2nrf_protocol
 ****************************************************************************/

static int nx2nrf_protocol(int nx_protocol)
{
  int nrf_protocol = 0;

