apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
  if (nx_protocol == IPPROTO_IP)
    {
      nrf_protocol = NRF_IPPROTO_IP;
    }
  else if (nx_protocol == IPPROTO_TCP)
    {
      nrf_protocol = NRF_IPPROTO_TCP;
    }
  else if (nx_protocol == IPPROTO_UDP)
    {
      nrf_protocol = NRF_IPPROTO_UDP;
    }
  else if (nx_protocol == IPPROTO_IPV6)
    {
      nrf_protocol = NRF_IPPROTO_IPV6;
    }
  else if (nx_protocol == IPPROTO_RAW)
    {
      nrf_protocol = NRF_IPPROTO_RAW;
    }
  else
    {
      nerr("unsupported nrf protocol %d\n", nx_protocol);
    }

  return nrf_protocol;
}

/****************************************************************************
 * Name: nx2nrf_sockaddr
 ****************************************************************************/

static void nx2nrf_sockaddr(struct sockaddr *nxaddress,
                            struct nrf_sockaddr *address)
{
  address->sa_family = nx2nrf_family(nxaddress->sa_family);

  if (address->sa_family == NRF_AF_INET)
    {
      struct sockaddr_in     *tmp1 = (struct sockaddr_in *)nxaddress;
      struct nrf_sockaddr_in *tmp2 = (struct nrf_sockaddr_in *)address;

      tmp2->sin_port        = tmp1->sin_port;
      tmp2->sin_addr.s_addr = tmp1->sin_addr.s_addr;
      tmp2->sin_len = sizeof(struct nrf_sockaddr_in);
    }
  else if (address->sa_family == NRF_AF_INET6)
    {
      struct sockaddr_in6     *tmp1 = (struct sockaddr_in6 *)nxaddress;
      struct nrf_sockaddr_in6 *tmp2 = (struct nrf_sockaddr_in6 *)address;

      tmp2->sin6_port     = tmp1->sin6_port;
      memcpy(&tmp2->sin6_addr, &tmp1->sin6_addr, sizeof(struct in6_addr));
      tmp2->sin6_scope_id = tmp1->sin6_scope_id;
      tmp2->sin6_len = sizeof(struct nrf_sockaddr_in6);
    }
  else
    {
      nerr("unsupported nrf sa_family %d\n", address->sa_family);
      address->sa_family = 0;
    }
}

/****************************************************************************
 * Name: nrf2nx_sockaddr
 ****************************************************************************/

static void nrf2nx_sockaddr(struct nrf_sockaddr *address,
                            struct sockaddr *nxaddress)
{
  nxaddress->sa_family = nrf2nx_family(address->sa_family);

  if (nxaddress->sa_family == AF_INET)
    {
      struct nrf_sockaddr_in *tmp1 = (struct nrf_sockaddr_in *)address;
      struct sockaddr_in     *tmp2 = (struct sockaddr_in *)nxaddress;

      tmp2->sin_port        = tmp1->sin_port;
      tmp2->sin_addr.s_addr = tmp1->sin_addr.s_addr;
    }
  else if (nxaddress->sa_family == AF_INET6)
    {
      struct nrf_sockaddr_in6 *tmp1 = (struct nrf_sockaddr_in6 *)address;
      struct sockaddr_in6     *tmp2 = (struct sockaddr_in6 *)nxaddress;

      tmp2->sin6_port        = tmp1->sin6_port;
      tmp2->sin6_flowinfo    = 0;
      memcpy(&tmp2->sin6_addr, &tmp1->sin6_addr, sizeof(struct in6_addr));
      tmp2->sin6_scope_id = tmp1->sin6_scope_id;
    }
  else
    {
      nerr("unsupported nx sa_family %d\n", nxaddress->sa_family);
      nxaddress->sa_family = 0;
    }
}

/****************************************************************************
 * Name: nrf_usrsock_shutdown
 ****************************************************************************/

static int nrf_usrsock_shutdown(int sockfd, int how)
{
  /* TODO */

  return 0;
}

/****************************************************************************
 * Name: nrf91_usrsock_send
 ****************************************************************************/

static int nrf91_usrsock_send(struct nrf91_usrsock_s *usrsock,
                              const void *buf, size_t len)
{
  return usrsock_response(buf, len, NULL);
}

/****************************************************************************
 * Name: nrf91_usrsock_send_ack
 ****************************************************************************/

static int nrf91_usrsock_send_ack(struct nrf91_usrsock_s *usrsock,
                                  uint32_t xid, int32_t result)
{
  struct usrsock_message_req_ack_s ack;

  ack.head.msgid = USRSOCK_MESSAGE_RESPONSE_ACK;
  ack.head.flags = (result == -EINPROGRESS);
  ack.head.events = 0;

  ack.xid    = xid;
  ack.result = result;

  return nrf91_usrsock_send(usrsock, &ack, sizeof(ack));
}

/****************************************************************************
 * Name: nrf91_usrsock_send_dack
 ****************************************************************************/

static int nrf91_usrsock_send_dack(struct nrf91_usrsock_s *usrsock,
                                   struct usrsock_message_datareq_ack_s *ack,
                                   uint32_t xid, int32_t result,
                                   uint16_t valuelen,
                                   uint16_t valuelen_nontrunc)
{
  ack->reqack.head.msgid = USRSOCK_MESSAGE_RESPONSE_DATA_ACK;
  ack->reqack.head.flags = 0;
  ack->reqack.head.events = 0;

  ack->reqack.xid    = xid;
  ack->reqack.result = result;

  if (result < 0)
    {
      result             = 0;
      valuelen           = 0;
      valuelen_nontrunc  = 0;
    }
  else if (valuelen > valuelen_nontrunc)
    {
      valuelen           = valuelen_nontrunc;
    }

  ack->valuelen          = valuelen;
  ack->valuelen_nontrunc = valuelen_nontrunc;

  return nrf91_usrsock_send(usrsock, ack, sizeof(*ack) + valuelen + result);
}

/****************************************************************************
 * Name: nrf91_usrsock_send_event
 ****************************************************************************/

static int nrf91_usrsock_send_event(struct nrf91_usrsock_s *usrsock,
                                    int16_t usockid, uint16_t events)
{
  struct usrsock_message_socket_event_s event;

  event.head.msgid  = USRSOCK_MESSAGE_SOCKET_EVENT;
  event.head.flags  = USRSOCK_MESSAGE_FLAG_EVENT;
  event.head.events = events;

  event.usockid = usockid;

  return nrf91_usrsock_send(usrsock, &event, sizeof(event));
}

/****************************************************************************
 * Name: nrf91_usrsock_event_callback
 ****************************************************************************/

static int nrf91_usrsock_event_callback(int16_t usockid, uint16_t events)
{
  return nrf91_usrsock_send_event(&g_usrsock, usockid, events);
}

/****************************************************************************
 * Name: nrf91_modem_getver
 ****************************************************************************/

static int nrf91_modem_getver(lte_version_t *version)
{
  char buffer1[16];
  char buffer2[16];
  int  ret = OK;

  memset(version, 0, sizeof(*version));
  ret = nrf_modem_at_scanf("AT%HWVERSION", "%%HWVERSION: %s %s",
                           buffer1, buffer2);
  if (ret > 0)
    {
      strncpy(version->bb_product, buffer1, LTE_VER_BB_PRODUCT_LEN);
      strncpy(version->np_package, buffer2, LTE_VER_NP_PACKAGE_LEN);
    }

  ret = nrf_modem_at_scanf("AT+CGMR", "%s", buffer1);
  if (ret > 0)
    {
      strncpy(version->fw_version, buffer1, LTE_VER_FIRMWARE_LEN);
      ret = 0;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_modem_actpdn
 *
 * Description:
 *   Activate the default packet data network: optionally (re)configure the
 *   APN, attach to the network (AT+CFUN=1), wait for registration and read
 *   the assigned IP address.
 *
 ****************************************************************************/

static int nrf91_modem_actpdn(FAR lte_apn_setting_t *apn,
                              FAR lte_pdn_t *pdn)
{
  FAR const char *pdptype = "IP";
  char resp[64];
  FAR char *p;
  FAR char *q;
  size_t n;
  int stat = 0;
  int tmp = 0;
  int elapsed = 0;
  int ret;

