apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
  switch (apn->ip_type)
    {
      case LTE_IPTYPE_V6:
        pdptype = "IPV6";
        break;
      case LTE_IPTYPE_V4V6:
        pdptype = "IPV4V6";
        break;
      default:
        pdptype = "IP";
        break;
    }

  /* (Re)configure the default PDN context when an APN is provided.  Toggle
   * the radio off first so the new context is used on (re)attach.
   */

  if (apn->apn != NULL && apn->apn[0] != '\0')
    {
      nrf_modem_at_printf("AT+CFUN=4");

      ret = nrf_modem_at_printf("AT+CGDCONT=0,\"%s\",\"%s\"",
                                pdptype, apn->apn);
      if (ret < 0)
        {
          nerr("AT+CGDCONT failed %d\n", ret);
          return ret;
        }

      if (apn->auth_type != LTE_APN_AUTHTYPE_NONE &&
          apn->user_name != NULL && apn->password != NULL)
        {
          ret = nrf_modem_at_printf("AT+CGAUTH=0,%u,\"%s\",\"%s\"",
                                    (unsigned)apn->auth_type,
                                    apn->user_name, apn->password);
          if (ret < 0)
            {
              nerr("AT+CGAUTH failed %d\n", ret);
              return ret;
            }
        }
    }

  /* Attach to the network */

  ret = nrf_modem_at_printf("AT+CFUN=1");
  if (ret < 0)
    {
      nerr("AT+CFUN=1 failed %d\n", ret);
      return ret;
    }

  /* Wait for network registration (1 = home, 5 = roaming) */

  while (elapsed < 120)
    {
      ret = nrf_modem_at_scanf("AT+CEREG?", "+CEREG: %d,%d", &tmp, &stat);
      if (ret >= 2 && (stat == 1 || stat == 5))
        {
          break;
        }

      nxsig_usleep(1000 * 1000);
      elapsed++;
    }

  if (stat != 1 && stat != 5)
    {
      nerr("LTE registration timed out, CEREG stat=%d\n", stat);
      return -ETIMEDOUT;
    }

  /* Fill the PDN info and read the assigned IP address from
   * "+CGPADDR: 0,\"a.b.c.d\"".
   */

  memset(pdn, 0, sizeof(*pdn));
  pdn->session_id = 0;
  pdn->active     = LTE_PDN_ACTIVE;
  pdn->apn_type   = apn->apn_type;
  pdn->ipaddr_num = 0;

  ret = nrf_modem_at_cmd(resp, sizeof(resp), "AT+CGPADDR=0");
  if (ret == 0)
    {
      p = strchr(resp, '"');
      if (p != NULL)
        {
          p++;
          q = strchr(p, '"');
          if (q != NULL)
            {
              n = (size_t)(q - p);
              if (n >= LTE_IPADDR_MAX_LEN)
                {
                  n = LTE_IPADDR_MAX_LEN - 1;
                }

              pdn->address[0].ip_type = apn->ip_type;
              memcpy(pdn->address[0].address, p, n);
              pdn->address[0].address[n] = '\0';
              pdn->ipaddr_num = 1;
            }
        }
    }

  return OK;
}

/****************************************************************************
 * Name: nrf91_ioctl_ltecmd
 ****************************************************************************/

static int nrf91_ioctl_ltecmd(int fd, int cmd, unsigned long arg)
{
  struct lte_ioctl_data_s  *ltecmd = (struct lte_ioctl_data_s *)(arg);
  int                     **result = (int **)ltecmd->outparam;
  int                       ret    = OK;

  switch (ltecmd->cmdid)
    {
      /* TODO: support for Nordic-specific functional modes 20-44 */

      case LTE_CMDID_POWERON:
        {
          ret = nrf_modem_at_printf("AT+CFUN=1");
          break;
        }

      case LTE_CMDID_POWEROFF:
        {
          ret = nrf_modem_at_printf("AT+CFUN=0");
          break;
        }

      case LTE_CMDID_RADIOON:
        {
          /* The radio is enabled by AT+CFUN=1 at power-on / PDN
           * activation, so there is nothing extra to do here.
           */

          ret = OK;
          break;
        }

      case LTE_CMDID_RADIOOFF:
        {
          ret = nrf_modem_at_printf("AT+CFUN=4");
          break;
        }

      case LTE_CMDID_ACTPDN:
        {
          lte_apn_setting_t **apn =
            (lte_apn_setting_t **)(ltecmd->inparam);
          lte_pdn_t **pdn =
            (lte_pdn_t **)(ltecmd->outparam + 1);
          ret = nrf91_modem_actpdn(*apn, *pdn);
          break;
        }

      case LTE_CMDID_GETVER:
        {
          lte_version_t **version =
            (lte_version_t **)(ltecmd->outparam + 1);
          ret = nrf91_modem_getver(*version);
          break;
        }

      case LTE_CMDID_GETIMEI:
        {
          char **imei = (char **)(ltecmd->outparam + 1);
          size_t **len = (size_t **)(ltecmd->outparam + 2);
          char buffer[32];
          char *ptr;
          ret = nrf_modem_at_cmd(buffer, 32, "AT+CGSN=1");
          ptr = strchr(buffer, '"') + 1;
          ptr[LTE_IMEI_LEN - 1] = 0;
          strncpy(*imei, ptr, **len);
          break;
        }

      case LTE_CMDID_GETQUAL:
      {
        lte_quality_t **quality =
          (lte_quality_t **)(ltecmd->outparam + 1);
        int tmp;
        int rsrp;
        int rsrq;
        int rssi;

        ret = nrf_modem_at_scanf("AT+CESQ",
                                 "+CESQ: %d,%d,%d,%d,%d,%d",
                                 &tmp, &tmp, &tmp, &tmp,
                                 &rsrq, &rsrp);
        if (ret > 0)
          {
            (*quality)->rsrq  = (rsrq / 2) - 19;
            (*quality)->rsrp  = rsrp - 140;
          }
        else
          {
            nerr("AT+CESQ failed %d\n", ret);
          }

        ret = nrf_modem_at_scanf("AT+CSQ",
                                 "+CSQ: %d,%d",
                                 &rssi, &tmp);
        if (ret > 0)
          {
            (*quality)->rssi  = rssi;
            (*quality)->sinr  = 0;
          }
        else
          {
            nerr("AT+CSQ failed %d\n", ret);
          }

        (*quality)->valid = true;
        break;
      }

      /* TODO: commands from include/nuttx/wireless/lte/lte.h */

      default:
        {
          nerr("unsupported cmd = %" PRId32, ltecmd->cmdid);
          break;
        }
    }

  if (result)
    {
      **result = ret;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_ioctl
 ****************************************************************************/

static int nrf91_usrsock_ioctl(int fd, int cmd, unsigned long arg)
{
  int ret = OK;

  if (fd < NRF_MODEM_MAX_SOCKET_COUNT)
    {
      nerr("ioctl not supported for socket %d", fd);
      ret = -EACCES;
      goto errout;
    }

