apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
  switch (cmd)
    {
      case SIOCLTECMD:
        {
          ret = nrf91_ioctl_ltecmd(fd, cmd, arg);
          break;
        }

      default:
        {
          ret = -ENOTTY;
          nerr("ioctl unsupported cmd %d", cmd);
          break;
        }
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_getsockopt_handler
 ****************************************************************************/

int nrf91_usrsock_setsockopt(int sockfd, int level, int optname,
                             const void *optval, unsigned int optlen)
{
  int ret = OK;

  ret = nrf_setsockopt(sockfd, level, optname, optval,
                        (nrf_socklen_t)optlen);
  if (ret < 0)
    {
      nerr("nrf_setsockopt failed %d", errno);
      ret = -errno;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_getsockopt_handler
 ****************************************************************************/

int nrf91_usrsock_getsockopt(int sockfd, int level, int optname,
                             void *optval, unsigned int *optlen)
{
  int ret = OK;

  ret = nrf_getsockopt(sockfd, level, optname, optval,
                       (nrf_socklen_t *)optlen);
  if (ret < 0)
    {
      nerr("nrf_getsockopt failed %d", errno);
      ret = -errno;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_poll_work
 ****************************************************************************/

static void nrf91_usrsock_poll_work(void *arg)
{
  struct nrf_pollfd *pollfd = arg;
  uint16_t           events = 0;
  int                ret    = OK;

  if (pollfd->revents & NRF_POLLIN)
    {
      events |= USRSOCK_EVENT_RECVFROM_AVAIL;
    }

  if (pollfd->revents & NRF_POLLERR)
    {
      events |= USRSOCK_EVENT_REMOTE_CLOSED;
    }

  if (pollfd->revents & NRF_POLLHUP)
    {
      events |= USRSOCK_EVENT_REMOTE_CLOSED;
    }

  if (events)
    {
      /* REVISIT: postpone REMOTE_CLOSED event if there are data to read */

      if (events & USRSOCK_EVENT_REMOTE_CLOSED)
        {
          while (g_usrsock.sock[pollfd->fd].recvpending == true)
            {
              nxsched_usleep(100);
            }
        }

      ret = nrf91_usrsock_event_callback(pollfd->fd, events);
      if (ret < 0)
        {
          nerr("usrsock_event_callback failed %d", ret);
        }
    }
}

/****************************************************************************
 * Name: nrf91_usrsock_poll_cb
 *
 *   The callback is invoked in an interrupt service routine.
 *
 ****************************************************************************/

static void nrf91_usrsock_poll_cb(struct nrf_pollfd *pollfd)
{
  memcpy(&g_usrsock.pollfd, pollfd, sizeof(struct nrf_pollfd));

  if (work_available(&g_usrsock.pollwork))
    {
      work_queue(LPWORK, &g_usrsock.pollwork, nrf91_usrsock_poll_work,
                 &g_usrsock.pollfd, 0);
    }
}

/****************************************************************************
 * Name: nrf91_usrsock_socket_handler
 ****************************************************************************/

static int nrf91_usrsock_socket_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len)
{
  const struct usrsock_request_socket_s *req = data;
  struct nrf_modem_pollcb                cb;
  int                                    fd  = 0;
  int                                    ret = 0;

  if (req->type == SOCK_CTRL)
    {
      /* Only one CTRL socket supported for now */

      fd = CTRL_SOCKET_FIRST;
    }
  else
    {
      fd = nrf_socket(nx2nrf_family(req->domain),
                      nx2nrf_type(req->type),
                      nx2nrf_protocol(req->protocol));
      if (ret < 0)
        {
          nerr("nrf_socket failed %d", errno);
          ret = -errno;
        }
      else
        {
          cb.callback = nrf91_usrsock_poll_cb;
          cb.events   = NRF_POLLIN | NRF_POLLHUP;
          cb.oneshot  = false;

          ret = nrf_setsockopt(fd, NRF_SOL_SOCKET, NRF_SO_POLLCB, &cb,
                               sizeof(struct nrf_modem_pollcb));
          if (ret < 0)
            {
              nerr("failed to connect poll cb %d", errno);
              ret = -errno;
            }
        }
    }

  /* Mark socket as used */

  if (fd >= 0)
    {
      usrsock->sock[fd].in_use = true;
      usrsock->sock[fd].recvpending = false;
    }

  ret = nrf91_usrsock_send_ack(usrsock, req->head.xid, fd);

  if (ret >= 0 && fd >= 0)
    {
      ret = nrf91_usrsock_send_event(usrsock, fd,
                                     USRSOCK_EVENT_SENDTO_READY);
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_close_handler
 ****************************************************************************/

static int nrf91_usrsock_close_handler(struct nrf91_usrsock_s *usrsock,
                                       const void *data, size_t len)
{
  const struct usrsock_request_close_s *req = data;
  int                                   ret = OK;

  if (req->usockid < NRF_MODEM_MAX_SOCKET_COUNT)
    {
      ret = nrf_close(req->usockid);
      if (ret < 0)
        {
          nerr("nrf_close failed %d", errno);
          ret = -errno;
        }

      usrsock->sock[req->usockid].in_use = false;
    }

  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

/****************************************************************************
 * Name: nrf91_usrsock_connect_handler
 ****************************************************************************/

static int nrf91_usrsock_connect_handler(struct nrf91_usrsock_s *usrsock,
                                         const void *data, size_t len)
{
  const struct usrsock_request_connect_s *req = data;
  struct nrf_sockaddr_in6                 address;
  int                                     ret = 0;

  nx2nrf_sockaddr((struct sockaddr *)(req + 1),
                  (struct nrf_sockaddr *)&address);

  ret = nrf_connect(req->usockid,
                    (const struct nrf_sockaddr *)&address,
                    (nrf_socklen_t)req->addrlen);
  if (ret < 0)
    {
      nerr("nrf_connect failed %d", errno);
      ret = -errno;
    }

  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

/****************************************************************************
 * Name: nrf91_usrsock_sendto_handler
 ****************************************************************************/

