apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
static int nrf91_usrsock_sendto_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len)
{
  const struct usrsock_request_sendto_s *req  = data;
  struct nrf_sockaddr_in6                address;
  struct sockaddr                       *tmp  = NULL;
  int                                    ret  = 0;
  bool                                   sent = 0;

  if (req->addrlen != 0)
    {
      tmp = (struct sockaddr *)(req + 1);
      nx2nrf_sockaddr(tmp, (struct nrf_sockaddr *)&address);
    }

  ret = nrf_sendto(req->usockid,
                   (const void *)(req + 1) + req->addrlen,
                   req->buflen,
                   req->flags,
                   req->addrlen ? (struct nrf_sockaddr *)&address : NULL,
                   (nrf_socklen_t)req->addrlen);
  if (ret < 0)
    {
      nerr("nrf_sendto failed %d", errno);
      ret = -errno;
    }

  sent = (ret > 0);
  ret = nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
  if (ret >= 0 && sent)
    {
      ret = nrf91_usrsock_send_event(usrsock, req->usockid,
                               USRSOCK_EVENT_SENDTO_READY);
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_recvfrom_handler
 ****************************************************************************/

static int nrf91_usrsock_recvfrom_handler(struct nrf91_usrsock_s *usrsock,
                                          const void *data, size_t len)
{
  const struct usrsock_request_recvfrom_s *req        = data;
  struct usrsock_message_datareq_ack_s    *ack        = NULL;
  struct sockaddr                         *tmp        = NULL;
  nrf_socklen_t                            outaddrlen = req->max_addrlen;
  socklen_t                                inaddrlen  = req->max_addrlen;
  size_t                                   buflen     = req->max_buflen;
  struct nrf_sockaddr_in6                  address;
  int                                      ret;
  int                                      recvlen;

  ack = (struct usrsock_message_datareq_ack_s *)usrsock->out;
  if (sizeof(*ack) + inaddrlen + buflen > sizeof(usrsock->out))
    {
      buflen = sizeof(usrsock->out) - sizeof(*ack) - inaddrlen;
    }

  ret = nrf_recvfrom(req->usockid,
                     (void *)(ack + 1) + inaddrlen,
                     buflen,
                     req->flags,
                     outaddrlen ? (struct nrf_sockaddr *)&address: NULL,
                     (nrf_socklen_t)outaddrlen ? &outaddrlen : NULL);
  if (ret < 0)
    {
      nerr("nrf_recvfrom failed %d", errno);
      ret = -errno;
    }

  if (outaddrlen != 0)
    {
      tmp = (struct sockaddr *)(ack + 1);
      nrf2nx_sockaddr((struct nrf_sockaddr *)&address, tmp);
    }

  recvlen = ret;

  if (ret > 0 && outaddrlen < inaddrlen)
    {
      memcpy((void *)(ack + 1) + outaddrlen,
             (void *)(ack + 1) + inaddrlen, ret);
    }

  /* Send data */

  ret = nrf91_usrsock_send_dack(usrsock, ack, req->head.xid,
                          ret, inaddrlen, outaddrlen);

  /* REVISIT: signal that more data can be available */

  if (ret >= 0 && buflen == recvlen)
    {
      usrsock->sock[req->usockid].recvpending = true;
      ret = nrf91_usrsock_send_event(usrsock, req->usockid,
                               USRSOCK_EVENT_RECVFROM_AVAIL);
    }
  else
    {
      usrsock->sock[req->usockid].recvpending = false;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_setsockopt_handler
 ****************************************************************************/

static int nrf91_usrsock_setsockopt_handler(struct nrf91_usrsock_s *usrsock,
                                            const void *data, size_t len)
{
  const struct usrsock_request_setsockopt_s *req = data;
  int                                        ret = 0;

  ret = nrf91_usrsock_setsockopt(req->usockid, req->level, req->option,
                                 req + 1, req->valuelen);
  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

/****************************************************************************
 * Name: nrf91_usrsock_getsockopt_handler
 ****************************************************************************/

static int nrf91_usrsock_getsockopt_handler(struct nrf91_usrsock_s *usrsock,
                                            const void *data, size_t len)
{
  const struct usrsock_request_getsockopt_s *req    = data;
  struct usrsock_message_datareq_ack_s      *ack;
  socklen_t                                  optlen = req->max_valuelen;
  int                                        ret;

  ack = (struct usrsock_message_datareq_ack_s *)usrsock->out;
  ret = nrf91_usrsock_getsockopt(req->usockid, req->level, req->option,
                                 ack + 1, &optlen);

  return nrf91_usrsock_send_dack(usrsock, ack, req->head.xid,
                           ret, optlen, optlen);
}

/****************************************************************************
 * Name: nrf91_usrsock_getsockname_handler
 ****************************************************************************/

static int nrf91_usrsock_getsockname_handler(struct nrf91_usrsock_s *usrsock,
                                             const void *data, size_t len)
{
  return -1;
}

/****************************************************************************
 * Name: nrf91_usrsock_getpeername_handler
 ****************************************************************************/

static int nrf91_usrsock_getpeername_handler(struct nrf91_usrsock_s *usrsock,
                                             const void *data, size_t len)
{
  return -1;
}

/****************************************************************************
 * Name: nrf91_usrsock_bind_handler
 ****************************************************************************/

static int nrf91_usrsock_bind_handler(struct nrf91_usrsock_s *usrsock,
                                      const void *data, size_t len)
{
  const struct usrsock_request_bind_s *req = data;
  struct nrf_sockaddr_in6              address;
  int                                  ret = 0;

  nx2nrf_sockaddr((struct sockaddr *)(req + 1),
                  (struct nrf_sockaddr *)&address);
  ret = nrf_bind(req->usockid, (const struct nrf_sockaddr *)&address,
                 req->addrlen);

  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

/****************************************************************************
 * Name: nrf91_usrsock_listen_handler
 ****************************************************************************/

