apache/nuttx/arch/arm/src/nrf91/nrf91_modem_sock.c
static int nrf91_usrsock_listen_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len)
{
  const struct usrsock_request_listen_s *req = data;
  int                                    ret = 0;

  ret = nrf_listen(req->usockid, req->backlog);
  if (ret < 0)
    {
      ret = -errno;
    }

  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

/****************************************************************************
 * Name: nrf91_usrsock_accept_handler
 ****************************************************************************/

static int nrf91_usrsock_accept_handler(struct nrf91_usrsock_s *usrsock,
                                        const void *data, size_t len)
{
  const struct usrsock_request_accept_s *req        = data;
  struct usrsock_message_datareq_ack_s  *ack;
  struct nrf_sockaddr_in6                address;
  nrf_socklen_t                          outaddrlen;
  socklen_t                              inaddrlen  = req->max_addrlen;
  int                                    sockfd     = 0;
  int                                    ret        = 0;

  if (inaddrlen == sizeof(struct sockaddr_in))
    {
      outaddrlen = sizeof(struct nrf_sockaddr_in);
    }
  else
    {
      outaddrlen = sizeof(struct nrf_sockaddr_in6);
    }

  ack = (struct usrsock_message_datareq_ack_s *)usrsock->out;
  sockfd = nrf_accept(req->usockid,
                      outaddrlen ? (struct nrf_sockaddr *)&address : NULL,
                      (nrf_socklen_t)outaddrlen ? &outaddrlen : NULL);
  if (ret < 0)
    {
      nerr("nrf_accpet failed %d", errno);
      ret = -errno;
    }

  nrf2nx_sockaddr((struct nrf_sockaddr *)&address,
                  (struct sockaddr *)(ack + 1));

  if (sockfd >= 0)
    {
      /* Append index as usockid to the payload */

      if (outaddrlen <= inaddrlen)
        {
          *(int16_t *)((void *)(ack + 1) + outaddrlen) = sockfd;
        }
      else
        {
          *(int16_t *)((void *)(ack + 1) + inaddrlen) = sockfd;
        }

      ret = sizeof(int16_t); /* Return usockid size */
    }
  else
    {
      ret = sockfd;
    }

  ret = nrf91_usrsock_send_dack(usrsock, ack, req->head.xid, ret,
                          inaddrlen, outaddrlen);
  if (ret >= 0 && sockfd >= 0)
    {
      ret = nrf91_usrsock_send_event(usrsock, sockfd,
                                     USRSOCK_EVENT_SENDTO_READY);
    }

  return ret;
}

/****************************************************************************
 * Name: nrf91_usrsock_ioctl_handler
 ****************************************************************************/

static int nrf91_usrsock_ioctl_handler(struct nrf91_usrsock_s *usrsock,
                                       const void *data, size_t len)
{
  const struct usrsock_request_ioctl_s *req = data;
  struct usrsock_message_datareq_ack_s *ack = NULL;
  size_t                                copylen;
  int                                   ret = 0;

  if (len < sizeof(*req))
    {
      return -EINVAL;
    }

  ack = (struct usrsock_message_datareq_ack_s *)usrsock->out;
  copylen = req->arglen;
  if (copylen > len - sizeof(*req) ||
      copylen > sizeof(usrsock->out) - sizeof(*ack))
    {
      return -EINVAL;
    }

  memcpy(ack + 1, req + 1, copylen);
  ret = nrf91_usrsock_ioctl(req->usockid,
                            req->cmd,
                            (unsigned long)(ack + 1));

  return nrf91_usrsock_send_dack(usrsock, ack, req->head.xid, ret,
                           copylen, copylen);
}

/****************************************************************************
 * Name: nrf91_usrsock_shutdown_handler
 ****************************************************************************/

static int nrf91_usrsock_shutdown_handler(struct nrf91_usrsock_s *usrsock,
                                          const void *data, size_t len)
{
  const struct usrsock_request_shutdown_s *req = data;
  int                                      ret = 0;

  ret = nrf_usrsock_shutdown(req->usockid, req->how);
  return nrf91_usrsock_send_ack(usrsock, req->head.xid, ret);
}

#ifndef CONFIG_NRF91_MODEM_AT
/****************************************************************************
 * Name: nrf91_modem_at_notify_handler
 ****************************************************************************/

static void nrf91_modem_at_notify_handler(const char *notif)
{
  /* TODO */

  printf("%s\n", notif);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: usrsock_register
 ****************************************************************************/

void usrsock_register(void)
{
#ifndef CONFIG_NRF91_MODEM_AT
  /* Initialize AT modem */

  nrf_modem_at_notif_handler_set(nrf91_modem_at_notify_handler);
  nrf_modem_at_cmd_custom_set(NULL, 0);
#endif
}

/****************************************************************************
 * Name: usrsock_request
 ****************************************************************************/

int usrsock_request(struct iovec *iov, unsigned int iovcnt)
{
  struct usrsock_request_common_s *common = NULL;
  int                              ret    = 0;

  /* Copy request to buffer */

  ret = usrsock_iovec_get(g_usrsock.in, sizeof(g_usrsock.in),
                          iov, iovcnt, 0, NULL);
  if (ret <= 0)
    {
      return ret;
    }

  common = (struct usrsock_request_common_s *)g_usrsock.in;

  if (common->reqid >= 0 &&
      common->reqid < USRSOCK_REQUEST__MAX)
    {
      ret = g_usrsock_handler[common->reqid](&g_usrsock,
                                             g_usrsock.in, ret);
      if (ret < 0)
        {
          nerr("Usrsock request %" PRId32 " failed: %d\n",
               common->reqid, ret);
        }
    }
  else
    {
      nerr("Invalid request id: %" PRId32 "\n", common->reqid);
    }

  return ret;
}
